{
  "url": "/video-library/api/tags/r.json",
  "videos": {
    "bioconductor/bioc-intro/tutorial": {
      "title": "Introduction to data analysis with R and Bioconductor",
      "type": "Tutorial",
      "instructors": [
        "lgatto"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "The Data science lesson is based on the Carpentries Ecology Curriculum.\nThere are no pre-requisites for this module, and the materials assume no prior\nknowledge about R and Bioconductor. It introduces R, RStudio, teaches data\ncleaning, management, analysis, and visualisation and introduces some\nBioconductor concepts.\n",
      "materials": [
        {
          "link": "https://carpentries-incubator.github.io/bioc-intro/",
          "title": "Introduction to data analysis with R and Bioconductor",
          "external": true
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/bioc-intro"
    },
    "bioconductor/bioc-project/tutorial": {
      "title": "The Bioconductor project",
      "type": "Tutorial",
      "instructors": [
        "kevinrue"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "The Bioconductor project lesson provides an introduction to the Bioconductor\nproject such as the Bioconductor home page, packages, package landing pages,\nand package vignettes, where to find help, Bioconductor workflows,\nBioconductor release schedule and versions, some core infrastructure,..\nIt is meant to be use in combination with other modules as part of a wider\nworkshop.\n",
      "materials": [
        {
          "link": "https://carpentries-incubator.github.io/bioc-project/",
          "title": "The Bioconductor project"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "versions": [

      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/bioc-project"
    },
    "bioconductor/rformassspectrometry/tutorial": {
      "title": "R for Mass Spectrometry",
      "type": "Tutorial",
      "instructors": [
        "lgatto"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "This material introduces participants to the analysis and exploration of mass\nspectrometry (MS) based proteomics data using R and Bioconductor. The course\nwill cover all levels of MS data, from raw data to identification and\nquantitation data, up to the statistical interpretation of a typical shotgun\nMS experiment and will focus on hands-on tutorials. At the end of this course,\nthe participants will be able to manipulate MS data in R and use existing\npackages for their exploratory and statistical proteomics data analysis.\n",
      "materials": [
        {
          "link": "https://rformassspectrometry.github.io/docs/",
          "title": "R for Mass Spectrometry"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "versions": [

      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/rformassspectrometry"
    },
    "bioconductor/isee/tutorial": {
      "description": "This workshop demonstrates the use of the iSEE package to create\nand configure interactive applications for the exploration of various types of\ngenomics data sets (e.g., bulk and single-cell RNA-seq, CyTOF, gene expression\nmicroarray). This workshop is presented as a lab session that combines an\ninstructor-led live demo, followed by hands-on experimentation guided by\ncompletely worked examples and stand-alone notes that participants may\ncontinue to use after the workshop.\n\nThe instructor-led live demo comprises three parts:\n1. Brief lecture on the package concept and functionality\n2. Overview of the graphical user interface\n3. Instructions to preconfigure iSEE apps\n\nThe hands-on lab comprises three parts:\n1. Inspection of single-cell RNA-seq data at various steps of a typical\ncomputational workflow, including quality control and dimensionality reduction\n2. Addition of custom panels to the user interface for advanced visualization.\n3. Additional questions from the participants, including individual use cases\nand suggestions for future developments\n",
      "materials": [
        {
          "link": "https://isee.github.io/iSEEWorkshop2020/",
          "title": "Interactive visualization of SummarizedExperiment objects with iSEE"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "title": "Interactive visualization of SummarizedExperiment objects with iSEE",
      "type": "Tutorial",
      "versions": [
        {
          "captions": null,
          "date": "2020-07-28",
          "length": "55M",
          "link": "qmoJtL8b438",
          "speakers": [
            "csoneson",
            "kevinrue",
            "federicomarini"
          ]
        }
      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/isee",
      "captioned": false
    },
    "bioconductor/epiforbioworkshop2022/tutorial": {
      "description": "Concepts of causal inference in epidemiology have important ramifications\nfor studies across bioinformatics and other fields of health research. In\nthis workshop, we introduce basic concepts of epidemiology, study design,\nand causal inference for bioinformaticians. Emphasis is placed on addressing\nbias and confounding as common threats to assessing a causal pathway in a\nvariety of study design types and when using common forms of analyses such\nas GWAS and survival analysis. Workshop participants will have the\nopportunity to create their own structural causal models (DAGs) using\ndagitty and ggdag and then use this model to determine how to assess an\nestimated causal effect. Examples using DESeq2, edgeR, and limma will be\nused to show how multivariable models can be fitted depending on the\nhypothesized causal relationship. Presented successfully at BioC2021 to a\nlarge audience of more than 100, updates that material by revising current\nexamples based on participant feedback as well as content updates.\n",
      "materials": [
        {
          "link": "https://chloemirzayi.com/epiforbioworkshop2022/articles/EpiForBioWorkshop.html",
          "title": "Epidemiology for Bioinformaticians"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "title": "Epidemiology for Bioinformaticians",
      "type": "Tutorial",
      "versions": [
        {
          "captions": null,
          "date": "2022-07-27",
          "length": "83M",
          "link": "u2ahgX823Fg",
          "speakers": [
            "cmirzayi"
          ]
        }
      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/epiforbioworkshop2022",
      "captioned": false
    },
    "bioconductor/bioc2022_tidytranscriptomics/tutorial": {
      "description": "This tutorial will showcase analysis of single-cell RNA sequencing data\nfollowing the tidy data paradigm. The tidy data paradigm provides a standard\nway to organise data values within a dataset, where each variable is a column,\neach observation is a row, and data is manipulated using an easy-to-understand\nvocabulary. Most importantly, the data structure remains consistent across\nmanipulation and analysis functions.\n\nThis can be achieved with the integration of packages present in the R CRAN\nand Bioconductor ecosystem, including tidySingleCellExperiment and tidyverse.\nThese packages are part of the tidytranscriptomics suite that introduces a\ntidy approach to RNA sequencing data representation and analysis. For more\ninformation see the tidy transcriptomics blog.\n",
      "materials": [
        {
          "link": "https://tidytranscriptomics-workshops.github.io/bioc2022_tidytranscriptomics/articles/tidytranscriptomics_case_study.html",
          "title": "Tidy Transcriptomics For Single-Cell RNA Sequencing Analyses"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "title": "Tidy Transcriptomics For Single-Cell RNA Sequencing Analyses",
      "type": "Tutorial",
      "versions": [
        {
          "captions": null,
          "date": "2022-07-28",
          "length": "1H27M",
          "link": "LKWcut6l--c",
          "speakers": [
            "stemangiola"
          ]
        }
      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/bioc2022_tidytranscriptomics",
      "captioned": false
    },
    "bioconductor/CompGenomicsBioc2022/tutorial": {
      "description": "This workshop consists of a demonstration of using DECIPHER and SynExtend for\ncommon analyses in comparative genomics. The immediate goal of this session\nis to use sequence data to uncover networks of functionally associated genes.\nThese networks consist of genetic regions under shared evolutionary pressure,\nwhich have previously been shown to imply some degree of conserved function.\n",
      "materials": [
        {
          "link": "https://www.ahl27.com/CompGenomicsBioc2022/index.html",
          "title": "Comparative Genomics with DECIPHER and SynExtend"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "title": "Comparative Genomics with DECIPHER and SynExtend",
      "type": "Tutorial",
      "versions": [
        {
          "captions": null,
          "date": "2022-07-29",
          "length": "1H5M",
          "link": "JgTc2jiMPF0",
          "speakers": [
            "ahl27"
          ]
        }
      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/CompGenomicsBioc2022",
      "captioned": false
    },
    "bioconductor/SOOBiocWorkshop/tutorial": {
      "title": "SpatialOmicsOverlay Workshop",
      "type": "Tutorial",
      "instructors": [
        "maddygriz",
        "mgrout81"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "This workshop will introduce users to the NanoString R package \nSpatialOmicsOverlay. This package is designed for use in interpretation and \npresentation of the multi-form data generated by NanoString's GeoMx ® \nDigital Spatial Profiler spatial biology platform. The GeoMx DSP produces \nboth rich imaging and genomics data. Integrating these data types \nfacilitates a deep understanding of the profiled tissue. The \nSpatialOmicsOverlay package integrates both of these data types, thereby by \nmaintaining the relationship between underlying tissue morphology and \nresultant gene expression.\n\nSpecifically, SpatialOmicsOverlay was developed to visualize and analyze the \nfree-handed nature of Region of Interest (ROI) selection in a GeoMx \nexperiment, as well as the immunofluorescence-guided segmentation process. \nThe overlay from the instrument is recreated in the R environment, which \nallows for plotting overlays with data like ROI type or gene expression. The \npackage provides a convenient workflow for users to generate customized, \nsharable visualizations.\n\nThe Introduction to SpatialOmicsOverlay vignette demonstrates how to use \nOME-TIFF files, which are exported from the GeoMx platform. Participants \nwill learn how to interact with this file type and generate informative \nplots over images. This vignette utilizes data from our Spatial Organ Atlas. \nThe Spatial Organ Atlas is a freely-accesible resource of whole \ntranscriptome spatial profiles of functional components of tissues from \nhuman and mouse generated using our Whole Transcriptome Atlas RNA assay. In \nparticular, vignette users will be analyzing data from the mouse brain. This \ncontent is similar to the vignette available with the package upon \ninstallation.\n",
      "materials": [
        {
          "link": "https://nanostring-biostats.github.io/SOOBiocWorkshop/articles/Introduction-to-SOO.html",
          "title": "Introduction to SpatialOmicsOverlay",
          "external": true
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/SOOBiocWorkshop"
    },
    "bioconductor/fluentGenomics/tutorial": {
      "title": "fluentGenomics: A plyranges and tximeta workflow",
      "type": "Tutorial",
      "instructors": [
        "mikelove"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "An extended workflow using the plyranges and tximeta packages for fluent\ngenomic data analysis. Use tximeta to correctly import RNA-seq transcript\nquantifications and summarize them to gene counts for downstream analysis.\nUse plyranges for clearly expressing operations over genomic coordinates and\nto combine results from differential expression and differential accessibility\nanalyses.\n",
      "materials": [
        {
          "link": "https://bit.ly/fluentGenomics",
          "title": "fluentGenomics: A plyranges and tximeta workflow"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "versions": [

      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/fluentGenomics"
    },
    "bioconductor/RNAseq123/tutorial": {
      "title": "RNA-seq analysis is easy as 1-2-3 with limma, Glimma and edgeR",
      "type": "Tutorial",
      "instructors": [
        "mritchie"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "The ability to easily and efficiently analyse RNA-sequencing data is a key\nstrength of the Bioconductor project. Starting with counts summarised at the\ngene-level, a typical analysis involves pre-processing, exploratory data\nanalysis, differential expression testing and pathway analysis with the\nresults obtained informing future experiments and validation studies. In this\nworkflow article, we analyse RNA-sequencing data from the mouse mammary gland,\ndemonstrating use of the popular edgeR package to import, organise, filter\nand normalise the data, followed by the limma package with its voom method,\nlinear modelling and empirical Bayes moderation to assess differential\nexpression and perform gene set testing. This pipeline is further enhanced\nby the Glimma package which enables interactive exploration of the results\nso that individual samples and genes can be examined by the user. The complete\nanalysis offered by these three packages highlights the ease with which\nresearchers can turn the raw counts from an RNA-sequencing experiment into\nbiological insights using Bioconductor.\n",
      "materials": [
        {
          "link": "https://bit.ly/RNAseq123",
          "title": "RNA-seq analysis is easy as 1-2-3 with limma, Glimma and edgeR"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "versions": [

      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/RNAseq123"
    },
    "bioconductor/RnaSeqGeneEdgeRQL/tutorial": {
      "title": "From reads to genes to pathways: differential expression analysis of RNA-Seq experiments using Rsubread and the edgeR quasi-likelihood pipeline",
      "type": "Tutorial",
      "instructors": [
        "yunshun"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "RNA sequencing (RNA-seq) has become a very widely used technology for\nprofiling gene expression. One of the most common aims of RNA-seq profiling\nis to identify genes or molecular pathways that are differentially expressed\n(DE) between two or more biological conditions. This article demonstrates a\ncomputational workflow for the detection of DE genes and pathways from RNA-seq\ndata by providing a complete analysis of an RNA-seq experiment profiling\nepithelial cell subsets in the mouse mammary gland. The workflow uses R\nsoftware packages from the open-source Bioconductor project and covers all\nsteps of the analysis pipeline, including alignment of read sequences, data\nexploration, differential expression analysis, visualization and pathway\nanalysis. Read alignment and count quantification is conducted using the\nRsubread package and the statistical analyses are performed using the edgeR\npackage. The differential expression analysis uses the quasi-likelihood\nfunctionality of edgeR.\n",
      "materials": [
        {
          "link": "https://bit.ly/RnaSeqGeneEdgeRQL",
          "title": "From reads to genes to pathways: RNA-Seq using Rsubread and edgeR"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "versions": [

      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/RnaSeqGeneEdgeRQL"
    },
    "bioconductor/SingscoreAMLMutations/tutorial": {
      "title": "Using singscore to predict mutations in AML from transcriptomic signatures",
      "type": "Tutorial",
      "instructors": [
        "bhuvad"
      ],
      "cover": {
        "link": "bioconductor-session.jpg",
        "alt": "Bioconductor logo"
      },
      "description": "Advances in RNA sequencing (RNA-seq) technologies that measure the\ntranscriptome of biological samples have revolutionised our ability to\nunderstand transcriptional regulatory programs that underpin diseases\nsuch as cancer. We recently published singscore - a single-sample, rank-based\ngene set scoring method which quantifies how concordant the transcriptional\nprofile of individual samples are relative to specific gene sets of interest.\nHere we demonstrate the application of singscore to investigate\ntranscriptional profiles associated with specific mutations or genetic lesions\nin acute myeloid leukemia. Using matched genomic and transcriptomic data\navailable through The Cancer Genome Atlas we show that scoring of appropriate\nsignatures can distinguish samples with corresponding mutations, reflecting\nthe ability of these mutations to drive aberrant transcriptional programs\ninvolved in leukemogenesis. We believe the singscore method is particularly\nuseful for studying heterogeneity within specific subsets of cancers, and as\ndemonstrated, singscore has the ability to identify samples where alternative\nmutations/genetic lesions appear to drive transcriptional programs.\n",
      "materials": [
        {
          "link": "https://bit.ly/SingscoreAMLMutations",
          "title": "Using singscore to predict mutations in AML from transcriptomic signatures"
        }
      ],
      "tags": [
        "bioconductor",
        "r"
      ],
      "versions": [

      ],
      "support_channel": "bioconductor",
      "video_support_channels": [
        "https://support.bioconductor.org"
      ],
      "gtn_id": "bioconductor/SingscoreAMLMutations"
    }
  }
}